# Задание 3. Детали
# Напишите программу, которая запрашивает у пользователя деталь, считает их количество и общую стоимость.

shop = [['каретка', 1200], ['шатун', 1000], ['седло', 300], ['педаль', 100], ['седло', 1500], ['рама', 12000], ['обод', 2000], ['шатун', 200], ['седло', 2700]]

while True:
    detail = input('Название детали: ')
    price = 0
    count = 0
    for i_sh in shop:
        for i_dt in i_sh:
            if i_dt == detail:
                count += 1
                price += shop[shop.index(i_sh)][1]
    print('Количество деталей:', count)
    print('Общая стоимость:', price)